## Staging: dns
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.notification-canada-ca-alt[0] will be created
  + resource "aws_acm_certificate" "notification-canada-ca-alt" {
      + arn                       = (known after apply)
      + domain_name               = "staging.notification.alpha.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.api.staging.notification.alpha.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "*.document.staging.notification.alpha.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "*.staging.notification.alpha.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "api.staging.notification.alpha.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "staging.notification.alpha.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.api.staging.notification.alpha.cdssandbox.xyz",
          + "*.document.staging.notification.alpha.cdssandbox.xyz",
          + "*.staging.notification.alpha.cdssandbox.xyz",
          + "api.staging.notification.alpha.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_acm_alt_notification_canada_ca_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.assets-notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
